### Terraform Initialization `$success`

### Terraform Validation `$success`

<details><summary>Validation Output</summary>

```

$Success! The configuration is valid.


```

</details>

### Terraform Plan `$success`

<details><summary>Show Plan</summary>

```

$
Terraform used the selected providers to generate the following execution
  + create
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.test_repo will be destroyed
  # (because google_artifact_registry_repository.test_repo is not in configuration)
  - resource "google_artifact_registry_repository" "test_repo" {
      - create_time      = "2023-10-16T11:27:05.782307Z" -> null
      - effective_labels = {} -> null
      - format           = "DOCKER" -> null
      - id               = "projects/oredata-ops-demo/locations/europe-west1/repositories/test-repository-02" -> null
      - labels           = {} -> null
      - location         = "europe-west1" -> null
      - mode             = "STANDARD_REPOSITORY" -> null
      - name             = "test-repository-02" -> null
      - project          = "oredata-ops-demo" -> null
      - repository_id    = "test-repository-02" -> null
      - terraform_labels = {} -> null
      - update_time      = "2023-10-16T11:27:05.782307Z" -> null
    }

  # google_artifact_registry_repository.test_repo_1 will be created
  + resource "google_artifact_registry_repository" "test_repo_1" {
      + create_time      = (known after apply)
      + effective_labels = (known after apply)
      + format           = "DDDDD"
      + id               = (known after apply)
      + location         = "europe-west1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "oredata-ops-demo"
      + repository_id    = "test_repository_02"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.


Note: You didn't use the -out option to save this plan, so Terraform can't
```

</details>

### Terraform Apply `$skipped`

*Pusher: @$salihdemirer-oredata, Action: `$pull_request`, Working Directory: `$`, Workflow: `$Terraform Workflow`*